From ptg@acm.org  Mon Mar 18 17:43:24 2002
Received: from localhost (localhost.localdomain [127.0.0.1])
	by champlain.ccs.neu.edu (8.9.3/8.8.7) with ESMTP id RAA25661
	for <plt-gnats>; Mon, 18 Mar 2002 17:43:24 -0500
Message-Id: <200203182243.RAA25661@champlain.ccs.neu.edu>
Date: Mon, 18 Mar 2002 17:43:24 -0500
From: Paul Graunke <ptg@acm.org>
To: bugs@plt-scheme.org
Subject: begin breaks define-struct inheritance

>Number:         5321
>Category:       mzscheme
>Synopsis:       begin breaks define-struct inheritance
>Confidential:   no
>Severity:       serious
>Priority:       medium
>Responsible:    mflatt
>State:          closed
>Class:          sw-bug
>Submitter-Id:   unknown
>Arrival-Date:   Mon Mar 18 17:50:00 EST 2002
>Closed-Date:    Wed Aug 21 15:09:09 EDT 2002
>Last-Modified:  Wed Aug 21 15:09:09 EDT 2002
>Originator:     Paul Graunke
>Release:        200alpha14-cvs18mar2002
>Organization:
titan
>Environment:
unix "SunOS subra.ccs.neu.edu 5.8 Generic_108528-12 sun4u sparc SUNW,Sun-Blade-100" (sparc-solaris) (get-display-depth) = 24
Docs Installed:
("help" "icons" "teachpack" "r5rs" "mzscheme" "mzlib" "mred" "drscheme" "misclib" "framework" "tools" "mzc")
Collections: 
(("/home/ptg/world/ptg/collects" ("cgi-compiler" "format" "schema" "net-apps" "cps-jvm" "vnc" "xwin" "pj" "tests" "util" "old-junk" "file")) ("/home/ptg/plt/collects" ("CVS" "afm" "algol60" "doc" "browser" "compiler" "cvs-time-stamp" "defaults" "drjava" "drscheme" "dynext" "eopl" "errortrace" "framework" "games" "graphics" "help" "hierlist" "htdp" "html" "icons" "lang" "launcher" "make" "mred" "mrflow" "mysterx" "mzcom" "mzlib" "mzscheme" "net" "parser-tools" "readline" "setup" "sirmail" "slatex" "slibinit" "srpersist" "stepper" "string-constants" "syntax" "tests" "tex2page" "texpict" "typeset" "version" "waterworld" "web-server" "xml")))
Human Language: english
>Description:
One define-struct inside a begin can not refer to (inherit from) another.
Function definitions inside top level begins can.
>How-To-Repeat:
> (define-struct a ())
> (define-struct (b a) ())
> (begin (define-struct d ()) (define-struct (e d) ()))
define-struct: parent struct type not defined in: d
> (begin (define (f) 5) (define (g) (f)))
> f
#<procedure:f>
> (f)
5
> (g)
5
> 
>Fix:

>Release-Note:

>Audit-Trail:
Responsible-Changed-From-To: steck->mflatt
Responsible-Changed-By: mflatt
Responsible-Changed-When: Sun Apr 21 19:39:32 2002
Responsible-Changed-Why:
    mz
State-Changed-From-To: open->closed
State-Changed-By: mflatt
State-Changed-When: Wed Aug 21 15:09:09 2002
State-Changed-Why:
    Fixed in v201
>Unformatted:

