From bugs+caf_=bugs=bugs.plt-scheme.org@plt-scheme.org Thu Sep  9 19:42:06 2010
Received: from mail-yx0-f172.google.com (mail-yx0-f172.google.com [209.85.213.172])
	by champlain.ccs.neu.edu (8.14.3/8.14.3) with ESMTP id o89NfxEs025399
	for <bugs@bugs.plt-scheme.org>; Thu, 9 Sep 2010 19:41:59 -0400
Message-Id: <201009092341.o89NfvvI025392@champlain.ccs.neu.edu>
Date: Thu, 9 Sep 2010 19:41:57 -0400
From: ryan@cs.utah.edu
To: bugs@racket-lang.org
Subject: apply bug in ->i with optional domain

>Number:         11180
>Category:       all
>Synopsis:       apply bug in ->i with optional domain
>Class:          sw-bug
>Responsible:    robby
>Severity:       serious
>Priority:       medium
>State:          closed
>Confidential:   no
>Arrival-Date:   Thu Sep 09 19:44:01 -0400 2010
>Closed-Date:    Thu Sep 09 22:42:54 -0400 2010
>Last-Modified:  Thu Sep 09 22:42:54 -0400 2010
>Originator:     Ryan Culpepper
>Organization:
plt
>Submitter-Id:   unknown
>Release:        5.0.1.5
>Environment:
Linux i686 / Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.9.2.9) Gecko/20100825 Ubuntu/10.04 (lucid) Firefox/3.6.9
>Description:
The wrapper generated by ->i calls apply with a bad argument list. It seems to be losing track of the optional arguments. It doesn't seem to matter whether the arguments are supplied or not; the function is unusable at any arity.
>How-To-Repeat:
> (define/contract (f x [y 0])
    (->i ([x number?]) ([y number?]) [_ number?])
   (+ x y))
> (f 1 2)
apply: expects type <proper list> as 2nd argument, given: '(1 2 . #f); other arguments were: #<procedure:f>

 === context ===
/home/ryan/projects/racket/collects/racket/private/misc.rkt:74:7

> (f 1)
apply: expects type <proper list> as 2nd argument, given: '(1 . #f); other arguments were: #<procedure:f>

 === context ===
/home/ryan/projects/racket/collects/racket/private/misc.rkt:74:7
>Fix:
>Audit-Trail:
From: Robby Findler <robby@eecs.northwestern.edu>
To: ryan@cs.utah.edu, bugs@racket-lang.org
Cc: nobody@racket-lang.org, bug-notification@racket-lang.org
Subject: Re: [racket-bug] all/11180: apply bug in ->i with optional domain
Date: Thu, 9 Sep 2010 18:55:46 -0500

 Thanks. I discovered that myself, shortly after sending that email. :(
 
 Robby
 
 On Thu, Sep 9, 2010 at 6:44 PM,  <ryan@cs.utah.edu> wrote:
 > A new problem report is waiting at
 > =C2=A0http://bugs.racket-lang.org/query/?cmd=3Dview&pr=3D11180
 >
 > Reported by Ryan Culpepper for release: 5.0.1.5
 >
 > *** Description:
 > The wrapper generated by ->i calls apply with a bad argument list. It see=
 ms to be losing track of the optional arguments. It doesn't seem to matter =
 whether the arguments are supplied or not; the function is unusable at any =
 arity.
 >
 > *** How to repeat:
 >> (define/contract (f x [y 0])
 > =C2=A0 =C2=A0(->i ([x number?]) ([y number?]) [_ number?])
 > =C2=A0 (+ x y))
 >> (f 1 2)
 > apply: expects type <proper list> as 2nd argument, given: '(1 2 . #f); ot=
 her arguments were: #<procedure:f>
 >
 > =C2=A0=3D=3D=3D context =3D=3D=3D
 > /home/ryan/projects/racket/collects/racket/private/misc.rkt:74:7
 >
 >> (f 1)
 > apply: expects type <proper list> as 2nd argument, given: '(1 . #f); othe=
 r arguments were: #<procedure:f>
 >
 > =C2=A0=3D=3D=3D context =3D=3D=3D
 > /home/ryan/projects/racket/collects/racket/private/misc.rkt:74:7
 >
 > *** Environment:
 > Linux i686 / Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.9.2.9) Gecko/20=
 100825 Ubuntu/10.04 (lucid) Firefox/3.6.9
 >
 >
Responsible changed from "nobody" to "robby" by robby@racket-lang.org at Thu, 09 Sep 2010 22:42:54 -0400
Reason>>> A commit by robby@racket-lang.org has resolved this report
  http://git.racket-lang.org/plt/commit/44fe632da5
State changed from "open" to "closed" by robby@racket-lang.org at Thu, 09 Sep 2010 22:42:54 -0400
Reason>>> A commit by robby@racket-lang.org has resolved this report
  http://git.racket-lang.org/plt/commit/44fe632da5
